In [31]:
import pandas as pd

In [32]:
data = {'Name':['Anna','Bob','Charlie','Diana','Eric'],
        'Age':[20,34,23,None,33],
        'Gender':['f','m','m','f','m'],
        'Job':['Programmer','Writer','Cook','Programmer','Teacher']}
df = pd.DataFrame(data)

In [33]:
df

      Name   Age Gender         Job
0     Anna  20.0      f  Programmer
1      Bob  34.0      m      Writer
2  Charlie  23.0      m        Cook
3    Diana   NaN      f  Programmer
4     Eric  33.0      m     Teacher

Preprocessing Pipelines:

* Drop Name column
* Impute ages
* Trun gender into binary/Numeric
* Encode jobs

In [34]:
from sklearn.impute import SimpleImputer
from sklearn.preprocessing import OneHotEncoder

In [35]:
df = df.drop(['Name'],axis=1)

In [36]:
df

    Age Gender         Job
0  20.0      f  Programmer
1  34.0      m      Writer
2  23.0      m        Cook
3   NaN      f  Programmer
4  33.0      m     Teacher

In [37]:
imputer = SimpleImputer(strategy='mean')
df['Age']=imputer.fit_transform(df[['Age']])

In [38]:
df

    Age Gender         Job
0  20.0      f  Programmer
1  34.0      m      Writer
2  23.0      m        Cook
3  27.5      f  Programmer
4  33.0      m     Teacher

In [39]:
df['Gender']=df['Gender'].map({'f':1,'m':0})

In [40]:
df

    Age  Gender         Job
0  20.0       1  Programmer
1  34.0       0      Writer
2  23.0       0        Cook
3  27.5       1  Programmer
4  33.0       0     Teacher

In [42]:
# OneHotEncoder jobs
encoder = OneHotEncoder()
matrix = encoder.fit_transform(df[['Job']]).toarray()

column_names = ['Programmer','Writer','Cook','Teacher']

for i in range(len(matrix.T)):
    df[column_names[i]]=matrix.T[i]
    
df = df.drop(['Job'],axis=1)

In [43]:
df

    Age  Gender  Programmer  Writer  Cook  Teacher
0  20.0       1         0.0     1.0   0.0      0.0
1  34.0       0         0.0     0.0   0.0      1.0
2  23.0       0         1.0     0.0   0.0      0.0
3  27.5       1         0.0     1.0   0.0      0.0
4  33.0       0         0.0     0.0   1.0      0.0